# 무료 프로그램 체험 CASE 1 ~ 19
TRIAL_DICTIONARY = {
    "피트니스": {
        # case 1, 2, 3(미업로드) ==> 정호중 선수로 바꿀 것
        "M": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
        ],
        # case 4, 5, 6(완료)
        "W": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
        ]
    },
    "필라테스": {
        # case 7, 8, 9(일부 완료(1~5))
        "M": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "하체 스트레칭 1 (실습)"},
            # {"day": 1, "title": "하체 스트레칭 2 (실습)"},
            # {"day": 2, "title": "하체 스트레칭 3 (실습)"},
            # {"day": 3, "title": "상체 스트레칭 1 (실습)"},
            # {"day": 4, "title": "상체 스트레칭 2 (실습)"},
            # {"day": 5, "title": "필라테스 초급 동작 1 (실습)"},
            # {"day": 6, "title": "필라테스 초급 동작 2 (실습)"}
        ],
        # case 10, 11, 12(미업로드)
        "W": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "틀어진 골반 교정 운동 2"},
            # {"day": 1, "title": "하체 스트레칭 1"},
            # {"day": 2, "title": "before start 1"},
            # {"day": 3, "title": "before start 2"},
            # {"day": 4, "title": "before start 3"},
            # {"day": 5, "title": "하체 스트레칭 2"},
            # {"day": 6, "title": "Core Integration (코어통합) LEVEL 1"}
        ]
    },
    "요가": {  # case 13  ==>  실습(drill) 없이 '강의(guide)'만 있음.
        "M": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "웜업 요가 I"},
            # {"day": 1, "title": "웜업 요가 II"},
            # {"day": 2, "title": "빈야사 기초"},
            # {"day": 3, "title": "빈야사의 기초 자세 1"},
            # {"day": 4, "title": "빈야사의 기초 자세 2"},
            # {"day": 5, "title": "빈야사의 기초 자세 3"},
            # {"day": 6, "title": "베이직 빈야사 I"}
        ],
        "W": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "웜업 요가 I"},
            # {"day": 1, "title": "웜업 요가 II"},
            # {"day": 2, "title": "빈야사 기초"},
            # {"day": 3, "title": "빈야사의 기초 자세 1"},
            # {"day": 4, "title": "빈야사의 기초 자세 2"},
            # {"day": 5, "title": "빈야사의 기초 자세 3"},
            # {"day": 6, "title": "베이직 빈야사 I"}
        ]
    },
    "댄스 카디오": {  # case 14, 15, 16(미업로드)
        "M": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "BASIC 전신 (실습)"},
            # {"day": 1, "title": "BASIC 상체 (실습)"},
            # {"day": 2, "title": "BASIC 하체"},
            # {"day": 3, "title": "BASIC 근력"},
            # {"day": 4, "title": "BASIC 힙합"},
            # {"day": 5, "title": "LEVEL UP 전신"},
            # {"day": 6, "title": "LEVEL UP 상체"}
        ],
        "W": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "BASIC 전신 (실습)"},
            # {"day": 1, "title": "BASIC 상체 (실습)"},
            # {"day": 2, "title": "BASIC 하체"},
            # {"day": 3, "title": "BASIC 근력"},
            # {"day": 4, "title": "BASIC 힙합"},
            # {"day": 5, "title": "LEVEL UP 전신"},
            # {"day": 6, "title": "LEVEL UP 상체"}
        ]
    },
    "서킷 트레이닝(맨몸운동)": {  # case 17, 18, 19(미업로드)  ==>  강의(guide) 없이 '실습(drill)'만 있음.
        "M": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "왕초보 전신&팔 운동1"},
            # {"day": 1, "title": "누워서 하는 복근&상체 운동"},
            # {"day": 2, "title": "허벅지 집중 운동"},
            # {"day": 3, "title": "코어 강화 운동"},
            # {"day": 4, "title": "엉덩이 자극 집중 운동"},
            # {"day": 5, "title": "운동량 up! 전신 유산소 운동1"},
            # {"day": 6, "title": "왕초보 전신+하체 운동1"}
        ],
        "W": [
            {"day": 0, "title": "기본기 - 하체 운동 (실습)"},
            {"day": 1, "title": "기본기 - 등/복근 운동 (실습)"},
            {"day": 2, "title": "기본기 - 힙 운동 (실습)"},
            {"day": 3, "title": "기본기 - 가슴/어깨 운동 (실습)"},
            {"day": 4, "title": "기본 & 케틀벨 - 하체 운동 (실습)"},
            {"day": 5, "title": "기본 & 케틀벨 - 등/복근 운동 (실습)"},
            {"day": 6, "title": "기본 & 케틀벨 - 힙 운동 (실습)"}
            # {"day": 0, "title": "왕초보 전신&팔 운동1"},
            # {"day": 1, "title": "누워서 하는 복근&상체 운동"},
            # {"day": 2, "title": "허벅지 집중 운동"},
            # {"day": 3, "title": "코어 강화 운동"},
            # {"day": 4, "title": "엉덩이 자극 집중 운동"},
            # {"day": 5, "title": "운동량 up! 전신 유산소 운동1"},
            # {"day": 6, "title": "왕초보 전신+하체 운동1"}
        ],
    }
}